Documents/ПереоценкаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПереоценкаОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладГотовойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПереоценка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПереоценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВводаВЭксплуатацию</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетИзноса</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимостьДоПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НакопленныйИзносДоПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяСтоимостьДоПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимостьПослеПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НакопленныйИзносПослеПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяСтоимостьПослеПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменениеПервоначальнаяСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменениеИзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменениеОстаточнойСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеБУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МОЛБУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаОС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ГруппыПереоценкиОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Периоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Коэффициенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ГруппыПереоценкиОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаИзноса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодгруппаИзноса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаРегионов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыРегионовПоПереоценкеОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособПоступления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПоступленияАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокПогашенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокПогашенияСтоимостиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеГруппыОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротивопожарныеОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОСПоОхранеОкружающейСреды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаОС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПереоценкаОС/Ext/ObjectModule.bsl
Процедура ДвиженияПоРегистрам(Выборка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ГруппаОС,
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|ПОМЕСТИТЬ ГруппыОС
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаСреза, ) КАК ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереоценкаОСТаблицаОС.ОС,
	|	ПереоценкаОСТаблицаОС.МОЛБУ,
	|	ПереоценкаОСТаблицаОС.ПодразделениеБУ,
	|	ПереоценкаОСТаблицаОС.ИзменениеПервоначальнаяСтоимости,
	|	ПереоценкаОСТаблицаОС.ИзменениеИзноса,
	|	ГруппыОС.ГруппаОС,
	|	ПереоценкаОСТаблицаОС.СчетУчета,
	|	ПереоценкаОСТаблицаОС.СчетИзноса
	|ИЗ
	|	Документ.ПереоценкаОС.ТаблицаОС КАК ПереоценкаОСТаблицаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыОС КАК ГруппыОС
	|		ПО ПереоценкаОСТаблицаОС.ОС = ГруппыОС.ОсновноеСредство
	|ГДЕ
	|	ПереоценкаОСТаблицаОС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГруппыОС";

	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();

	СтрокаТаблицыОС = Результат.Выбрать();

	Пока СтрокаТаблицыОС.Следующий() Цикл
		
		Если СтрокаТаблицыОС.ИзменениеПервоначальнаяСтоимости <> 0 Тогда
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			
			Движение.СчетДт = СтрокаТаблицыОС.СчетУчета;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства]=СтрокаТаблицыОС.ОС;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.МОЛ]=СтрокаТаблицыОС.МОЛБУ;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения]=СтрокаТаблицыОС.ПодразделениеБУ;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ГруппыОС]=СтрокаТаблицыОС.ГруппаОС;
			
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8510");
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства]=СтрокаТаблицыОС.ОС;
			
			Движение.Сумма	= СтрокаТаблицыОС.ИзменениеПервоначальнаяСтоимости;
			
			Движение.Содержание = "Переоценка первоначальной стоимости";
		КонецЕсли;
		
		Если СтрокаТаблицыОС.ИзменениеИзноса <> 0 Тогда
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8510");
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства]=СтрокаТаблицыОС.ОС;
			
			Движение.СчетКт = СтрокаТаблицыОС.СчетИзноса;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства]=СтрокаТаблицыОС.ОС;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.МОЛ]=СтрокаТаблицыОС.МОЛБУ;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения]=СтрокаТаблицыОС.ПодразделениеБУ;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ГруппыОС]=СтрокаТаблицыОС.ГруппаОС;
			
			Движение.Сумма	= СтрокаТаблицыОС.ИзменениеИзноса;
			
			Движение.Содержание = "Переоценка стоимости износа ";
		КонецЕсли;
		
	КонецЦикла;
	Движения.Хозрасчетный.Записать();
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ)
	
	// Проверка существования проведенного документа "ПереоценкаОС" в текущем году
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПереоценкаОС.Ссылка
	|ИЗ
	|	Документ.ПереоценкаОС КАК ПереоценкаОС
	|ГДЕ
	|	ПереоценкаОС.Дата МЕЖДУ &НачалоГода И &КонецГода
	|	И ПереоценкаОС.Проведен
	|	И ПереоценкаОС.Ссылка <> &Ссылка
	|	И ПереоценкаОС.Организация = &Организация";
	
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецГода", КонецГода(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	//Если Выборка.Количество() <> 0 Тогда
	//	Предупреждение("Уже существует проведенный документ ""Переоценка Основных средств в текущем году!" + Символы.ПС + "Документ не будет проведен"); 
	//	Отказ = Истина;	
	//КонецЕсли;
	
	ДвиженияПоРегистрам(Выборка);
	
	
	
КонецПроцедуры // ОбработкаПроведения

Процедура Печать() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПереоценкаОС.ПолучитьМакет("Печать");
	
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация=Организация;
	Область.Параметры.Номер=ПолучитьНомерНаПечать(ЭтотОбъект);
	Область.Параметры.Дата=Формат(Дата,"ДФ=dd.MM.yyyy");
	Область.Параметры.период=Формат(ПериодПереоценки,"ДФ='гггг"" г"".'");
	ТабДок.Вывести(Область);
	
	
	// ТаблицаОС
	Область = Макет.ПолучитьОбласть("ТаблицаОСШапка");
	ТабДок.Вывести(Область);
	ОбластьТаблицаОС = Макет.ПолучитьОбласть("ТаблицаОС");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщийИтог");
	ОбластьИтогПоГруппировке = Макет.ПолучитьОбласть("ИтогПоГруппировке");
	
	Результат = ПолучитьВыборкуПоТабличнойЧасти();
	
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщие=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщие.Следующий();
	
	ВыборкаГруппа=ВыборкаОбщие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппа.Следующий() Цикл
		ОбластьИтогПоГруппировке.Параметры.Заполнить(ВыборкаГруппа);
		ТабДок.Вывести(ОбластьИтогПоГруппировке,ВыборкаГруппа.Уровень());
		
		ВыборкаОС=ВыборкаГруппа.Выбрать();
		Пока ВыборкаОС.Следующий() Цикл
			ОбластьТаблицаОС.Параметры.Заполнить(ВыборкаОС);
			ТабДок.Вывести(ОбластьТаблицаОС,ВыборкаОС.Уровень());
		КонецЦикла;
		
	КонецЦикла;
	
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщие);
	ТабДок.Вывести(ОбластьОбщийИтог);
	
	// Подвал
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(Подвал);
	
	ТабДок.ФиксацияСверху = 5;
	ТабДок.ФиксацияСлева = 3;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб  = Истина;
	ТабДок.ПоказатьУровеньГруппировокСтрок(1);
	
	ТабДок.ПовторятьПриПечатиСтроки=ТабДок.Область(5,,5);
	
	ТабДок.Показать();
	
КонецПроцедуры

Функция ПолучитьВыборкуПоТабличнойЧасти()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПереоценкаОСТаблицаОС.НомерСтроки,
	|	ПереоценкаОСТаблицаОС.ОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПереоценкаОСТаблицаОС.ОС,
	|	ПереоценкаОСТаблицаОС.СчетУчета КАК СчетУчета,
	|	ПереоценкаОСТаблицаОС.СчетИзноса,
	|	ПереоценкаОСТаблицаОС.ПервоначальнаяСтоимостьДоПереоценки КАК ПервоначальнаяСтоимостьДоПереоценки,
	|	ПереоценкаОСТаблицаОС.НакопленныйИзносДоПереоценки КАК НакопленныйИзносДоПереоценки,
	|	ПереоценкаОСТаблицаОС.ОстаточнаяСтоимостьДоПереоценки КАК ОстаточнаяСтоимостьДоПереоценки,
	|	ПереоценкаОСТаблицаОС.ДатаВводаВЭксплуатацию,
	|	ПереоценкаОСТаблицаОС.КоэффициентПереоценки,
	|	ПереоценкаОСТаблицаОС.ПервоначальнаяСтоимостьПослеПереоценки КАК ПервоначальнаяСтоимостьПослеПереоценки,
	|	ПереоценкаОСТаблицаОС.НакопленныйИзносПослеПереоценки КАК НакопленныйИзносПослеПереоценки,
	|	ПереоценкаОСТаблицаОС.ОстаточнаяСтоимостьПослеПереоценки КАК ОстаточнаяСтоимостьПослеПереоценки,
	|	ПереоценкаОСТаблицаОС.ИзменениеПервоначальнаяСтоимости КАК ИзменениеПервоначальнаяСтоимости,
	|	ПереоценкаОСТаблицаОС.ИзменениеИзноса КАК ИзменениеИзноса,
	|	ПереоценкаОСТаблицаОС.ИзменениеОстаточнойСтоимости КАК ИзменениеОстаточнойСтоимости,
	|	ПереоценкаОСТаблицаОС.ГруппаОС КАК ГруппаОС,
	|	ПереоценкаОСТаблицаОС.ГруппаОС.Порядок КАК ГруппаОСПорядок
	|ИЗ
	|	Документ.ПереоценкаОС.ТаблицаОС КАК ПереоценкаОСТаблицаОС
	|ГДЕ
	|	ПереоценкаОСТаблицаОС.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаОСПорядок,
	|	ПереоценкаОСТаблицаОС.ОС.ИнвентарныйНомер
	|ИТОГИ
	|	СУММА(ПервоначальнаяСтоимостьДоПереоценки),
	|	СУММА(НакопленныйИзносДоПереоценки),
	|	СУММА(ОстаточнаяСтоимостьДоПереоценки),
	|	СУММА(ПервоначальнаяСтоимостьПослеПереоценки),
	|	СУММА(НакопленныйИзносПослеПереоценки),
	|	СУММА(ОстаточнаяСтоимостьПослеПереоценки),
	|	СУММА(ИзменениеПервоначальнаяСтоимости),
	|	СУММА(ИзменениеИзноса),
	|	СУММА(ИзменениеОстаточнойСтоимости)
	|ПО
	|	ОБЩИЕ,
	|	ГруппаОС";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры
